Revit 2027 API
FabricationMaterialType Enumeration
 An enumerated type listing all fabrication material types.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum FabricationMaterialType
Public Enumeration FabricationMaterialType
public enum class FabricationMaterialType
type FabricationMaterialType
Members
Member name | Value | Description
Containment | 3 |  Containment material type (index/specification name)
Ductwork | 1 |  Flatbed material type (thickness/wire gauge)
Pipework | 2 |  Pipework material type (index/specification name)
Unknown | 0 |  Unknown material type
See Also
Reference
Autodesk.Revit.DB Namespace